app/controllers/api/v1/schedules_controller.rb

INSERT INTO "schedules" ("title", "content", "created_at", "updated_at", "num_member", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["title", "shopping"], ["content", "around"], ["created_at", "2020-07-15 22:37:19.884876"], ["updated_at", "2020-07-15 22:37:19.884876"], ["num_member", 1], ["user_id", 1]]
---
    def create

        @schedule = Schedule.new(schedule_params)

        if @schedule.save

SELECT "schedules".* FROM "schedules" WHERE "schedules"."title" = ? LIMIT ?  [["title", "Meet up"], ["LIMIT", 1]]
UPDATE "schedules" SET "content" = ?, "updated_at" = ? WHERE "schedules"."id" = ?  [["content", "with customer at 9pm"], ["updated_at", "2020-06-12 21:51:58.484532"], ["id", 14]]
---
    def update

        id = Schedule.find_by(title: params[:schedule][:title])[:user_id]
        id2 = params[:schedule][:user_id]
        if (id == id2)
            if @schedule.update(schedule_params)

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
DELETE FROM "schedules" WHERE "schedules"."id" = ?  [["id", 14]]
---
    def destroy

        id = params[:user_id]
        id2 = Schedule.find_by_id(params[:id].to_i)[:user_id]

        if (id == id2)
            @schedule.destroy

SELECT "schedules".* FROM "schedules" WHERE "schedules"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def find_schedule
        @schedule =  Schedule.find_by(id:params[:id])